In [2]:
import pandas as pd
import numpy as np

s = pd.Series(([1,2,3,4,5, np.nan,6,7,8]))
s

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
6    6.0
7    7.0
8    8.0
dtype: float64

In [3]:
# create a date range starting at an ISO-formatted date (YYYY-MM-DD)
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
# create a dataframe using the date range we created above as the index

df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.294159  0.454314 -0.083907  0.066285
2013-01-02  0.137670 -1.073559 -0.304455  0.341478
2013-01-03  0.500916  0.136270 -0.628538 -0.984941
2013-01-04 -0.503307 -1.006962  0.567524 -0.438747
2013-01-05  0.849315 -0.903817 -0.653000 -0.860299
2013-01-06  2.096230  0.475221 -0.015651 -0.351582

In [5]:
dict = { "country": ["France", "USA", "Japan", "Italy"], "city I visited": ["Paris", "Laguna Beach", "Niseko", "Rome"], "rating": [5, 3.8, 5, 4 ]}

brics = pd.DataFrame(dict)

brics

  country city I visited  rating
0  France          Paris     5.0
1     USA   Laguna Beach     3.8
2   Japan         Niseko     5.0
3   Italy           Rome     4.0

In [6]:
brics.index= (["Fr", "US", "NP", "It"])
brics

   country city I visited  rating
Fr  France          Paris     5.0
US     USA   Laguna Beach     3.8
NP   Japan         Niseko     5.0
It   Italy           Rome     4.0

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -0.294159  0.454314 -0.083907  0.066285
2013-01-02  0.137670 -1.073559 -0.304455  0.341478
2013-01-03  0.500916  0.136270 -0.628538 -0.984941
2013-01-04 -0.503307 -1.006962  0.567524 -0.438747
2013-01-05  0.849315 -0.903817 -0.653000 -0.860299

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.values

array([[-0.29415888,  0.45431408, -0.08390651,  0.0662854 ],
       [ 0.13766968, -1.07355919, -0.30445496,  0.34147812],
       [ 0.50091628,  0.13626952, -0.62853836, -0.9849412 ],
       [-0.50330681, -1.00696202,  0.56752408, -0.43874672],
       [ 0.84931508, -0.90381699, -0.65299987, -0.86029855],
       [ 2.09622989,  0.47522112, -0.01565069, -0.35158172]])

In [11]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.464444 -0.319756 -0.186338 -0.371301
std    0.941380  0.751097  0.455017  0.513838
min   -0.503307 -1.073559 -0.653000 -0.984941
25%   -0.186202 -0.981176 -0.547518 -0.754911
50%    0.319293 -0.383774 -0.194181 -0.395164
75%    0.762215  0.374803 -0.032715 -0.038181
max    2.096230  0.475221  0.567524  0.341478

In [12]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.294159    0.137670    0.500916   -0.503307    0.849315    2.096230
B    0.454314   -1.073559    0.136270   -1.006962   -0.903817    0.475221
C   -0.083907   -0.304455   -0.628538    0.567524   -0.653000   -0.015651
D    0.066285    0.341478   -0.984941   -0.438747   -0.860299   -0.351582